Catalogs/упШиныУзлыИАгрегаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упШиныУзлыИАгрегаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыШинУзловИАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТранспортныеСредства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.упМоделиТС</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиОпределятьКонечныйОстатокТопливаПоДаннымДатчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиОпределятьКонечныйПробегПоДаннымДатчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПодбиратьВозвращениеВГаражВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПодбиратьГаражВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатчикУровняТоплива</Name>
					<Comment>Используется для автоматического заполнения путевого листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеЗоны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьФиксироватьДанныеОМестоположенииСМобильногоКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредстваПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосадочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетНеобходимыхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПакетыДокументовТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерывМеждуРейсами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФормаПутевогоЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:EnumRef.упТипыПечатныхФормПутевогоЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьНаличиеУстановленныхТрекеровКромеМобильногоКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнаряженнаяМасса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильЛиний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыКузововТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидГСМОсновной</Name>
					<Comment>Используется для автоматического заполнения путевого листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упЭкологическиеКлассыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гаражи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гараж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаражныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКлассыОпасныхГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлассОпасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьВидыГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемБака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/упПодборАгрегатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДатаОстатков) Тогда
		ДатаОстатков = Параметры.ДатаОстатков
	Иначе
		ДатаОстатков = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	ТипОборудования = Неопределено;
	
	Если НЕ Параметры.Свойство("ТипОборудования", ТипОборудования) Тогда
		ТипОборудования = Справочники.упШиныУзлыИАгрегаты.ПустаяСсылка();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатов, "ЭтоАгрегат", ТипОборудования = Справочники.упШиныУзлыИАгрегаты.ПустаяСсылка(), Истина); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатовБезТС, "ЭтоАгрегат", ТипОборудования = Справочники.упШиныУзлыИАгрегаты.ПустаяСсылка(), Истина); 
	
	Если Параметры.Свойство("ТипДокумента") Тогда
		ТипДокумента = Параметры.ТипДокумента;
		Если НЕ ТипДокумента = ТИП("ДокументСсылка.упПоступлениеАгрегатов") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатов, "Период", Новый Граница(ДатаОстатков, ВидГраницы.Включая), Истина); 
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатовБезТС, "Период", Новый Граница(ДатаОстатков, ВидГраницы.Включая), Истина); 
		КонецЕсли;
	КонецЕсли;
	                         
	Если Параметры.Свойство("ТранспортноеСредство") Тогда
		ТранспортноеСредство = Параметры.ТранспортноеСредство;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатов, "ТС", ТранспортноеСредство, Истина); 
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатов, "ТС", Справочники.упТранспортныеСредства.ПустаяСсылка(), Истина); 
	КонецЕсли;
	
	Если Параметры.Свойство("МодельТС") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатовБезТС, "МодельТС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.МодельТС,"Модель"), Истина); 
	КонецЕсли;
	
	Если Параметры.Свойство("Состояние") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОстаткиАгрегатов, "Состояние", Параметры.Состояние, ВидСравненияКомпоновкиДанных.ВСписке);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОстаткиАгрегатовБезТС, "Состояние", Параметры.Состояние, ВидСравненияКомпоновкиДанных.ВСписке);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокАгрегаты, "Состояние", Параметры.Состояние, ВидСравненияКомпоновкиДанных.ВСписке);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДопОборудование, "Состояние", Параметры.Состояние, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Склад = ПредопределенноеЗначение("Справочник.упСклады.ПустаяСсылка");
	
	Если Параметры.Свойство("Склад") Тогда	
		Если ЗначениеЗаполнено(Параметры.Склад) Тогда
			Склад = Параметры.Склад;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не Склад = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиАгрегатов, "Склад", Склад, Истина);
	КонецЕсли;
	
	ЗакрыватьПриВыбореАгрегата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЗакрыватьПриВыбореАгрегата", Ложь);
		
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОстаткиАгрегатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = Элементы.ОстаткиАгрегатов.ДанныеСтроки(ВыбраннаяСтрока);
	сткПараметры = Новый Структура("МестоХранения, Агрегат, Количество, Тип, ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(сткПараметры, текСтрока);
	
	ВводКоличестваЗавершение(сткПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиАгрегатовБезТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = Элементы.ОстаткиАгрегатовБезТС.ДанныеСтроки(ВыбраннаяСтрока);
	сткПараметры = Новый Структура("МестоХранения, Агрегат, Количество, Тип, ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(сткПараметры, текСтрока);
	
	ВводКоличестваЗавершение(сткПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАгрегатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	текСтрока = Элементы.СписокАгрегаты.ДанныеСтроки(ВыбраннаяСтрока);
	сткПараметры = Новый Структура("МестоХранения, Агрегат, Количество, Тип, ЕдиницаИзмерения, СтатьяРасходов");
	ЗаполнитьЗначенияСвойств(сткПараметры, текСтрока);
	сткПараметры.Количество = 1;
	сткПараметры.МестоХранения = ПредопределенноеЗначение("Справочник.упСклады.ПустаяСсылка");
	
	ВводКоличестваЗавершение(сткПараметры);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	мсвРезультат = СформироватьВозвращаемоеЗначение();
	Закрыть(мсвРезультат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимость()	
	
	Элементы.ПодобранныеАгрегатыАгрегат.ТолькоПросмотр = Истина;
	Элементы.ПодобранныеАгрегатыЕдиницаИзмерения.ТолькоПросмотр = Истина;
	Элементы.ПодобранныеАгрегатыТип.ТолькоПросмотр = Истина;
	Элементы.ПодобранныеАгрегатыМестоХранения.ТолькоПросмотр = Истина;
	
	Если ТипЗнч(ТипОборудования) = Тип("СправочникСсылка.упДополнительноеОборудование") Тогда
		Элементы.грпНиз.Заголовок = НСтр("ru = 'Подобранное доп. оборудование'");
		Элементы.ПодобранныеАгрегатыАгрегат.Заголовок	= НСтр("ru = 'Доп. оборудование'");
		Элементы.ПодобранныеАгрегатыАгрегат.КартинкаШапки = БиблиотекаКартинок.упМонтаж;
		
		Элементы.ОстаткиАгрегатовБезТСАгрегат.Заголовок	= НСтр("ru = 'Доп. оборудование'");
		Элементы.ОстаткиАгрегатовБезТСАгрегат.КартинкаШапки = БиблиотекаКартинок.упМонтаж;

		Элементы.ОстаткиАгрегатовАгрегат.Заголовок	= НСтр("ru = 'Доп. оборудование'");
		Элементы.ОстаткиАгрегатовАгрегат.КартинкаШапки = БиблиотекаКартинок.упМонтаж;

	Иначе
		Элементы.грпНиз.Заголовок = НСтр("ru = 'Подобранные агрегаты'");
		Элементы.ПодобранныеАгрегатыАгрегат.Заголовок	= НСтр("ru = 'Агрегат'");
		Элементы.ПодобранныеАгрегатыАгрегат.КартинкаШапки = БиблиотекаКартинок.упАгрегаты;
		
		Элементы.ОстаткиАгрегатовБезТСАгрегат.Заголовок	= НСтр("ru = 'Агрегат'");
		Элементы.ОстаткиАгрегатовБезТСАгрегат.КартинкаШапки = БиблиотекаКартинок.упАгрегаты;
		
		Элементы.ОстаткиАгрегатовАгрегат.Заголовок	= НСтр("ru = 'Агрегат'");
		Элементы.ОстаткиАгрегатовАгрегат.КартинкаШапки = БиблиотекаКартинок.упАгрегаты;
		
	КонецЕсли;
	
	Если ТипДокумента = ТИП("ДокументСсылка.упПоступлениеАгрегатов") Тогда
		
		Если ТипЗнч(ТипОборудования) = Тип("СправочникСсылка.упДополнительноеОборудование") Тогда
			Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаДопОборудование.Видимость = Истина;
			Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаАгрегаты.Видимость = Ложь;
			ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Список доп.оборудования на %1'"), Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'"));
		Иначе	
			Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаАгрегаты.Видимость = Истина;
			Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаДопОборудование.Видимость = Ложь;
			ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Список агрегатов на %1'"), Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'"));
		КонецЕсли;
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаОстатки.Видимость = Ложь;
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаОстаткиБезТС.Видимость = Ложь;
		
	ИначеЕсли ТипДокумента = ТИП("ДокументСсылка.упРемонтИТОТС") и ТранспортноеСредство = Справочники.упТранспортныеСредства.ПустаяСсылка() Тогда
		ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Остатки на %1'"), Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'"));
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаОстатки.Видимость = Ложь;
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаАгрегаты.Видимость = Ложь;
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаОстаткиБезТС.Видимость = Истина;
		
	ИначеЕсли ТипДокумента = ТИП("ДокументСсылка.упКорректировкаОстатковАгрегатов") Тогда	
		
		Элементы.грпНиз.Видимость = Ложь;
		Элементы.ФормаПеренестиВДокумент.Видимость = Ложь;
		
		Если ТипЗнч(ТипОборудования) = Тип("СправочникСсылка.упДополнительноеОборудование") Тогда
			ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Список доп.оборудования на %1'"), Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'"));
		Иначе	
			ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Список агрегатов на %1'"), Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'"));
		КонецЕсли;
	
	Иначе
		
		ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Остатки на %1'"), Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'"));
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаОстатки.Видимость = Истина;
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаАгрегаты.Видимость = Ложь;
		Элементы.грпСтраницы.ПодчиненныеЭлементы.СтраницаОстаткиБезТС.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ПодобранныеАгрегатыКоличество.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Функция СформироватьВозвращаемоеЗначение()
	
	мсвРезультат = Новый Массив;
	
	тзПодобранныеМатериалы = ПодобранныеАгрегаты.Выгрузить();
	тзПодобранныеМатериалы.Свернуть("Агрегат, МестоХранения","Количество");
	
	Для каждого текСтрока Из ПодобранныеАгрегаты Цикл
		Если ТипДокумента = Тип("ДокументСсылка.упПоступлениеАгрегатов") Тогда
			сткСоставСтроки = Новый Структура("Агрегат, МестоХранения, СтатьяРасходов, Количество");
		Иначе
			сткСоставСтроки = Новый Структура("Агрегат, МестоХранения, Количество");
		КонецЕсли;
		
	    ЗаполнитьЗначенияСвойств(сткСоставСтроки, текСтрока);
		мсвРезультат.Добавить(сткСоставСтроки);
	КонецЦикла; 
	
	Возврат мсвРезультат;
		
КонецФункции

#Область ОповещенияПоСобытиям

&НаКлиенте
Процедура ВводКоличестваЗавершение(ДополнительныеПараметры)
	
	Количество = ДополнительныеПараметры.Количество;
	Отказ = Ложь;
	Если Количество = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество не может быть равно нулю'");
		Отказ = Истина;
	ИначеЕсли Количество < 0 Тогда	
		ТекстСообщения = НСтр("ru = 'Количество не может быть отрицательным'");
		Отказ = Истина;
	КонецЕсли; 
	
	Если Истина
		И НЕ Отказ
		И ЗакрыватьПриВыбореАгрегата
	Тогда
		Закрыть(ДополнительныеПараметры.Агрегат);	
	КонецЕсли;
		
	Отбор = Новый Структура("Агрегат",ДополнительныеПараметры.Агрегат);		
	НайденныеСтроки = ПодобранныеАгрегаты.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() Тогда
		ТекстСообщения = НСтр(СтрШаблон("ru = 'Введено несколько строк с выбранным агрегатом. %1'",СокрЛП(ДополнительныеПараметры.Агрегат)));	
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,ТекстСообщения);
	Иначе
		НоваяСтрока = ПодобранныеАгрегаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры,, "Количество");
		НоваяСтрока.Количество = Количество;		
	КонецЕсли;
	
КонецПроцедуры // ВводКоличестваЗавершение()

&НаКлиенте
Процедура ПодобранныеАгрегатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрокаПодбора = ПодобранныеАгрегаты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПодобранныеАгрегаты.Удалить(ТекущаяСтрокаПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДопОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	текСтрока = Элементы.СписокДопОборудование.ДанныеСтроки(ВыбраннаяСтрока);
	сткПараметры = Новый Структура("МестоХранения, Агрегат, Количество, Тип, ЕдиницаИзмерения, СтатьяРасходов");
	ЗаполнитьЗначенияСвойств(сткПараметры, текСтрока);
	сткПараметры.Количество = 1;
	сткПараметры.Агрегат = текСтрока.ДопОборудование;
	сткПараметры.МестоХранения = ПредопределенноеЗначение("Справочник.упСклады.ПустаяСсылка");
	
	ВводКоличестваЗавершение(сткПараметры);

КонецПроцедуры

#КонецОбласти 

#КонецОбласти
